#!/usr/bin/env python
# coding: utf-8

# In[2]:


#TASK 6
"""Написати функцію, яка буде реалізувати логіку циклічного зсуву елементів в списку. Тобто функція приймає два аргументи:
список і величину зсуву (якщо ця величина додатна - пересуваємо з кінця на початок, якщо від'ємна - навпаки -
пересуваємо елементи з початку списку в його кінець).
   Наприклад:
   fnc([1, 2, 3, 4, 5], shift=1) --> [5, 1, 2, 3, 4]
   fnc([1, 2, 3, 4, 5], shift=-2) --> [3, 4, 5, 1, 2]"""


def fnc(lst, shift):
    l = len(lst)
    if shift > 0:
        i = -1
        while i >= -shift:
            lst.insert(0, lst[i])
            i -= 1
        lst = lst[:l]
    if shift < 0:
        i = 0
        for i in range (- shift):
            lst.append(lst[i])
        lst = lst[-shift:]
    print(lst)
        
        
fnc([1, 2, 3, 4, 5], shift = 1)
fnc([1, 2, 3, 4, 5], shift = -2)